let name = "Джон"; //1 задание
let admin;
admin = name;
alert(admin);
////////////////////////////////////////////////////

let a = prompt("Первое число?"); //2 задание
let b = prompt("Второе число?");

alert(Number(a) + Number(b));
///////////////////////////////////////////////////

 for (let i = 1;i<=10;i++) { //3 задание
    if (i%2==0) alert("Четное число=>"+i);
    }
//////////////////////////////////////////////////

let i = 0; //4 задание
while (i < 3) 
{
    alert(`number ${i}!`);
    i++;
}
/////////////////////////////////////////////////

let number = prompt("Введите число больше 100");//5 задание 
while (number<=100) {
    number= prompt("Вы ввели число меньшее либо равное 100, попробуйте снова!");
    }
////////////////////////////////////////////////

let n = prompt("Введите интервал:");//6 задание
for (let i = 2; i <= n; i++) {
  let check=1;
  for (let j = 2; (j <= i/2)&&(check==1); j=j+1) {
     if (i%j==0) check=0;
    }
    if (check==1) {alert(i);}
}